#+TITLE:       Theme Notes
#+AUTHOR:      Cole Brown
#+EMAIL:       code@brown.dev
#+DATE:        [2021-05-04]


* ├TODO───┤ org-mode faces - headline todo


├DONE───┤


Ideally: TODO states should never blend into a headline.

Taken care of in [[*org-mode 'done' - should not be quite as dark][org-mode 'done' - should not be quite as dark]]:
  - org-done
  - org-checkbox-statistics-done

These faces are all from Doom, I think:
  - +org-todo-active
    + (bold font-lock-constant-face org-todo)
  - +org-todo-onhold
    + (bold warning org-todo)
  - +org-todo-project
    + (bold font-lock-doc-face org-todo)
  - warning
    + #DFAF8F - zenburn: orange
    + bold
  - font-lock-constant-face
    + #BFEBBF - zenburn: green+4
  - font-lock-doc-face
    + #9FC59F - zenburn: green+2
  - org-todo
    + #7F9F7F - zenburn: green
    + bold

org-todo-keywords
org-todo-keyword-faces
  - faces for keywords

#+BEGIN_SRC emacs-lisp
(let ((fg (doom-darken (doom-color 'magenta) 0.1))
      (bg (doom-color 'bg-alt)))
  (face-spec-set
   '-s//zenburn/face/org/todo.keyword/todo
   `((t  ;; display type
      ;; Attributes plist:
      :foreground ,fg
      ;; whitespace-mode is on top of org-mode faces, so it fucks up the bg for
      ;; the short ones like "├TODO───┤"...
      :background ,bg
      :weight bold
      ;; :underline t
      ))))
  ;; (def-face
  ;; <face-spec-set internals...>
  ;; "Face for todo keyword in todo sequence."
  ;; :group 'doom-zenburn-theme)

;; NO: orange, green+2, blue-1, red-1
(custom-theme-set-faces! 'doom-zenburn
  ;; ├CURRENT┤
  `(+org-todo-active :foreground ,(doom-color 'violet)
                     :background ,(doom-color 'bg-alt))
  ;; ├WAITING┤, ├HOLDING┤
  `(+org-todo-onhold :foreground ,(doom-darken (doom-color 'magenta) 0.3)
                     :background ,(doom-color 'bg-alt))
  ;; ├PROJECT┤
  `(+org-todo-project :foreground ,(doom-color 'blue-3)
                      :background ,(doom-color 'bg-alt)))

(let ((wrap "├─┤"))
  (setq org-todo-keyword-faces
        (list (list (-s//org/todo.keyword "TODO" wrap)    '-s//zenburn/face/org/todo.keyword/todo)
              (cons (-s//org/todo.keyword "PROJECT" wrap) '+org-todo-project)

              (cons (-s//org/todo.keyword "CURRENT" wrap) '+org-todo-active)
              (cons (-s//org/todo.keyword "▶" wrap)       '+org-todo-active)

              (cons (-s//org/todo.keyword "WAITING" wrap) '+org-todo-onhold)
              (cons (-s//org/todo.keyword "HOLDING" wrap) '+org-todo-onhold)
              (cons (-s//org/todo.keyword "?" wrap)       '+org-todo-onhold)
              (cons (-s//org/todo.keyword "…" wrap)       '+org-todo-onhold)
              (cons (-s//org/todo.keyword "⁈" wrap)       '+org-todo-onhold)

              (cons (-s//org/todo.keyword "DONE" wrap)    'org-done)
              (cons (-s//org/todo.keyword "X" wrap)       'org-done)
              (cons (-s//org/todo.keyword "SUCCESS" wrap) 'org-done)
              (cons (-s//org/todo.keyword "X" wrap)       'org-done)
              (cons (-s//org/todo.keyword "FAILURE" wrap) 'org-done)
              (cons (-s//org/todo.keyword "✘" wrap)       'org-done)
              (cons (-s//org/todo.keyword "KILLED" wrap)  'org-done)
              (cons (-s//org/todo.keyword "÷" wrap)       'org-done))))

"hello there"
#+END_SRC


#+BEGIN_SRC emacs-lisp
(-reduce (lambda (x y)
           (if (stringp x)
               (format "%s\n(\"%s\" . %s)" x (car y) (cdr y))
             (format "(\"%s\" . %s)\n(\"%s\" . %s)" (car x) (cdr x) (car y) (cdr y))))
         org-todo-keyword-faces)
#+END_SRC

#+RESULTS:
#+begin_example
("├TODO───┤" . (warning bold))
("├PROJECT┤" . +org-todo-project)
("├CURRENT┤" . +org-todo-active)
("├▶──────┤" . +org-todo-active)
("├WAITING┤" . +org-todo-onhold)
("├HOLDING┤" . +org-todo-onhold)
("├?──────┤" . +org-todo-onhold)
("├…──────┤" . +org-todo-onhold)
("├⁈──────┤" . +org-todo-onhold)
("├DONE───┤" . org-done)
("├X──────┤" . org-done)
("├SUCCESS┤" . org-done)
("├X──────┤" . org-done)
("├FAILURE┤" . org-done)
("├✘──────┤" . org-done)
("├KILLED─┤" . org-done)
("├÷──────┤" . org-done)
#+end_example


